import Card from "./Card";

let providers = [
    {
        link: 'aws',
        name: 'أمازون ويب سيرفيسز (AWS)',
        description: 'ريادة عالمية في الحوسبة السحابية تدعم التحول الرقمي في المملكة',
        image: '/aws.webp',
        details: 'تُعد خدمات أمازون ويب (AWS) من أبرز مزودي الخدمات السحابية عالميًا، وتلعب دورًا محوريًا في دعم رؤية المملكة 2030 من خلال استثمارات استراتيجية في البنية التحتية السحابية والذكاء الاصطناعي. في عام 2025، أعلنت AWS عن شراكة استراتيجية مع شركة "هيومن" (HUMAIN) السعودية، تهدف إلى إنشاء "منطقة الذكاء الاصطناعي" باستثمار يتجاوز 5 مليارات دولار.'
    },
    {
        link: 'azure',
        name: 'مايكروسوفت أزور (Microsoft Azure)',
        description: 'منصة سحابية موثوقة تدعم التحول الرقمي في المملكة',
        image: '/azure.jpg',
        details: 'أعلنت مايكروسوفت في ديسمبر 2024 عن اكتمال بناء ثلاث مناطق توافر (Availability Zones) في المنطقة الشرقية من المملكة، مع توقع بدء التشغيل في عام 2026. تهدف هذه البنية التحتية إلى تقديم خدمات سحابية عالية الأداء تدعم الخصوصية المحلية وتلبي احتياجات القطاعات الحكومية والخاصة، بما يتماشى مع رؤية السعودية 2030.'
    },
    {
        link: 'gcp',
        name: 'منصة جوجل السحابية (Google Cloud Platform)',
        description: 'حلول سحابية متقدمة مع تركيز على الذكاء الاصطناعي في المملكة',
        image: '/google.jpg',
        details: 'أطلقت جوجل كلاود أول منطقة سحابية لها في الدمام، المملكة العربية السعودية، في عام 2023، بالتعاون مع شركة أرامكو. في أكتوبر 2024، أعلنت جوجل كلاود وصندوق الاستثمارات العامة عن شراكة لتطوير مركز عالمي للذكاء الاصطناعي في الدمام، يهدف إلى تدريب الملايين من الطلاب والمهنيين السعوديين على تقنيات الذكاء الاصطناعي، وتعزيز التطبيقات المحلية للغة العربية.'
    },
    {
        link: 'alibaba',
        name: 'علي بابا كلاود (Alibaba Cloud)',
        description: 'خدمات سحابية صينية المنشأ مع تواجد محلي في المملكة',
        image: '/alibaba.webp',
        details: 'أطلقت علي بابا كلاود أول مركز بيانات لها في الرياض عام 2022، بالتعاون مع شركة الاتصالات السعودية (STC). في عام 2023، اختارت علي بابا كلاود حي الملك عبدالله المالي (KAFD) كموقع رئيسي لعملياتها في المملكة، مما يعكس التزامها بدعم التحول الرقمي في السعودية من خلال تقديم خدمات سحابية متقدمة وحلول ذكاء اصطناعي.'
    }
];

function CardGrid() {
    return (
        <div className="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-4 gap-3 m-2 mb-4">
            {providers.map((provider) => (
                <Card provider={provider} />
            ))}
        </div>
    );
}

export default CardGrid;